src/test/resources/soap-payloads/P24-Thunes/P24NegativeAmount.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:schemas-cybersource-com:transaction-data-1.{{WSDLVersion}}">
    <soapenv:Header>
        <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken wsu:Id="UsernameToken-1" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
                <wsse:Username>thunes_cert_so</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">juB3g2V3sXCKQ5GMb3ERbqUhbTvgVnugNRNPZcd7YadH3yqPuSUdYoi4BajvoEb/S3lSKV1hmtZoLukVWYav78LwSr1250Z7cHvyDZLOAmTERfJubbTu4bvzrHI4uIDnSjnVrvIO6CUZOuo5QrmTEL6+BZEocjrcz8lkw35FRTwT7UnEcCZQ0AdVMZON/AUl/RsYSkMHbEbutLFeBQGb883NDJrsdIuHBnW2uH3XRy42AxId1r5H2VVdjd0g1Cd8nEcAYQW+8JiYEVHHksHPErr41OO+2GOrXwGCXxsjJJ+55lLKtNZqQdkpUIx6nyl2F+4nDhC3QHh7hwbs0qVrWA==</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soapenv:Header>
    <soapenv:Body xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
        <requestMessage xmlns="urn:schemas-cybersource-com:transaction-data-1.211">
            <merchantID>thunes_cert_so</merchantID>
            <merchantReferenceCode>refnumb1234</merchantReferenceCode>
            <invoiceHeader>
                <merchantDescriptor>Online Store</merchantDescriptor>
            </invoiceHeader>
            <billTo>
                <firstName>Badri</firstName>
                <lastName>R</lastName>
                <street1>Bangalore</street1>
                <city>CHENNAI</city>
                <state>AR</state>
                <postalCode>75001</postalCode>
                <country>FR</country>
                <phoneNumber>+33623456789</phoneNumber>
                <email>test@thunes.com</email>
            </billTo>
            <shipTo>
                <firstName>Badrinarayanan</firstName>
                <lastName>Raj</lastName>
                <street1>KR</street1>
                <city>Bangalore</city>
                <state>AR</state>
                <postalCode>75001</postalCode>
                <country>FR</country>
                <phoneNumber>+33623456789</phoneNumber>
            </shipTo>
            <purchaseTotals>
                <currency>PLN</currency>
                <grandTotalAmount>-20</grandTotalAmount>
            </purchaseTotals>
            <apPaymentType>PTT</apPaymentType>
            <apSaleService run="true">
                <cancelURL>https://www.test.com</cancelURL>
                <successURL>https://www.test1.com</successURL>
                <failureURL>https://www.test2.com</failureURL>
            </apSaleService>
        </requestMessage>
    </soapenv:Body>
</soapenv:Envelope>